import re
# \d+ \.? \d+
# 123 . 1549

# 判断用户输入的内容是否是数字，如果是数字转换成为数字类型
num = input('请输入一段数字：')
if re.fullmatch(r'\d+(\.?\d+)*',num): # fullmatch 匹配整个字符串
    print('是个数字')
    print(float(num))
else:
    print('不是一个数字')

# 以非数字开头，后面有字母，数字，_，-组成的长度4到14的字符串
# r'^\D[a-z0-9A-Z_\-]{3,13}',

# 邮箱匹配
# r'^([A-Za-z0-9_\-\.])+@([A-Za-z0-9_\-\.])+\.([A-Za-z]{2,4})$
# 以一个以上的数字，字母，_,-,.开头，@，和
# a@t.cn

# 手机号匹配
# r'^((13[0-9])|(14[5|7])|(15([0-3]|[5-9]))|(18[05-9]))\d{8}$'
# 130~139
# 145 147 150~153~155~159 180 185~189

# 匹配身份证号
# 前六位 1xxxxx~9xxxxx  1800~2099 01~09|10|11|12(月份） 01~29|10|20|30|31(日)   三位xxx  [0-9Xx]最后一位可能是数字0~9或者X
# r'^[1-9]\d{5}(18|19|20|)\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$'

# 匹配车牌号

# r'^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$'
