'''面向对象与面向过程
面向过程：根据业务逻辑从上到下写代码。
面向对象：将变量与函数绑定到一起，分类进行封装，每个程序只要负责分配给自己的分类，这样能够更快速的开发程序，减少了重复代码。
面向过程编程最易被初学者接受，其往往用一长段代码来实现指定功能，开发过程的思路是将数据与函数按照执行的逻辑顺序组织在一起，数据与函数分开考虑，面向过程基本是由函数组成的。

01.面向过程编程
面向过程编程的关注点在于怎么做

把完成某一个需求的 所有步骤 从头到尾 逐步实现
根据开发需求，将某些 功能独立 的代码 封装 成一个又一个 函数
最后完成的代码，就是顺序地调用 不同的函数
特点:

注重步骤与过程，不注重职责分工
如果需求复杂，代码会变得很复杂
开发复杂项目，没有固定的套路，开发难度很大！
'''

'''02. 面向对象基本概念
面向对象编程（Object Oriented Programming，OOP，面向对象程序设计）和面相过程编程，是两种不同的编程方式。

面向对象编程的关注点在于谁来做

相比较函数，面向对象是更大的封装，根据职责在 一个对象中封装多个方法

在完成某一个需求前，首先确定职责 —— 要做的事情（方法）
根据 职责 确定不同的 对象，在对象内部封装不同的方法（多个）
最后完成的代码，就是顺序地调用不同对象的相应方法。
特点:

注重 对象和职责，不同的对象承担不同的职责。
更加适合应对复杂的需求变化，是专门应对复杂项目开发，提供的固定套路。
需要在面向过程基础上，再学习一些面向对象的语法。 '''